<!DOCTYPE html>
<html lang="en">



<head>

  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta name="description" content="">
  <meta name="author" content="">

  <title>Rapport</title>

  <!-- Bootstrap core CSS -->
  <link href="vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet">

  <!-- Custom styles for this template -->
  <link href="css/scrolling-nav.css" rel="stylesheet">

</head>

<body id="page-top">

  <!-- Navigation -->
  <nav class="navbar navbar-expand-lg navbar-dark bg-dark fixed-top" id="mainNav">
    <div class="container">
      <a class="navbar-brand js-scroll-trigger" href="#page-top">BIF7002 – Séminaire de bio-informatique  </a>
      <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarResponsive" aria-controls="navbarResponsive" aria-expanded="false" aria-label="Toggle navigation">
        <span class="navbar-toggler-icon"></span>
      </button>
      <div class="collapse navbar-collapse" id="navbarResponsive">
        <ul class="navbar-nav ml-auto">
          <li class="nav-item">
            <a class="nav-link js-scroll-trigger" href="#Introduction">Introduction</a>
          </li>
          <li class="nav-item">
            <a class="nav-link js-scroll-trigger" href="#Application">Application</a>
          </li>
          <li class="nav-item">
            <a class="nav-link js-scroll-trigger" href="#Demonstration">Demonstration</a>
          </li>
          <li class="nav-item">
            <a class="nav-link js-scroll-trigger" href="#Conclusion">Conclusion</a>
          </li>
        </ul>
      </div>
    </div>
  </nav>

  <header class="bg-primary text-white">
    <div class="container text-center">
      <h1>Application de l'I.A en bioinformatique</h1>
      <p class="lead">par Rafik M. Chemli</p>
    </div>
  </header>
  <section id="Introduction">
    <div class="container">
      <div class="row">
        <div class="col-lg-8 mx-auto">
          <h2>Résumé</h2>
          <div align="justify">
            <p>Deux m&eacute;thodes de pens&eacute;e principales sont au c&oelig;ur de toutes les &eacute;tudes en bioinformatique. La premiere consiste &agrave; comparer et &agrave; regrouper les donn&eacute;es en fonction de similitudes biologiquement significatives, et la deuxi&egrave;me, &agrave; analyser un type de donn&eacute;es pour d&eacute;duire et comprendre les observations relatives &agrave; un autre type de donn&eacute;es. Ces approches sont refl&eacute;t&eacute;es dans les principaux objectifs du domaine, qui sont de comprendre et d&rsquo;organiser les informations associ&eacute;es aux mol&eacute;cules biologiques &agrave; grande &eacute;chelle. Que ce soit dans les domaines de la sant&eacute; ou de l&rsquo;agronomie, l&rsquo;utilisation d&rsquo;outils computationnels tels que les techniques d&rsquo;intelligence artificielle semblent amplifier les b&eacute;n&eacute;fices &eacute;conomiques et sociaux de ces technologies en plein essor. Par example, L&rsquo;intelligence artificielle pourrait permettre d&rsquo;&eacute;tablir de nouveaux mod&egrave;les pr&eacute;dictifs int&eacute;grant des ensembles des donn&eacute;es dynamiques. Il existe ainsi une r&eacute;elle opportunit&eacute; de tacler les probl&eacute;matiques de sant&eacute;, environnementales et logistiques tel que la famine et la pollution industrielle.
            </p>
            <p>&nbsp;</p>
            <p>
              <strong>Mots-cl&eacute;s </strong> : Agriculture de pr&eacute;cision, fouille de donn&eacute;es, g&eacute;nomique, Intelligence artificielle, apprentissage automatique, sant&eacute;.</p>
            </p>
              <p>&nbsp;</p>
                <p>&nbsp;</p>
          <h2>Introduction</h2>

          <p><strong>Bioinformatique &amp;&nbsp; </strong><strong>Intelligence artificielle</strong></p>
          <p>La bio-informatique est un domaine interdisciplinaire associant math&eacute;matiques, informatique et ing&eacute;nierie afin d'organiser et analyser des donn&eacute;es biologiques. Le domaine est li&eacute; en particulier &agrave; la biologie mol&eacute;culaire pour mieux comprendre et pour mieux conna&icirc;tre les ph&eacute;nom&egrave;nes et processus biologiques. Les applications de base de la bio-informatique comprennent la gestion de donn&eacute;es et d'informations biologiques, l'analyse de s&eacute;quences biologiques, et l'analyse de structures mol&eacute;culaires, alors que les applications avanc&eacute;es incluent la mod&eacute;lisation de syst&egrave;mes, l'exp&eacute;rimentation dite &laquo;&nbsp;in silico&nbsp;&raquo; et la simulation de ces syst&egrave;mes biologiques. Les progr&egrave;s r&eacute;alis&eacute;s dans les domaines de la g&eacute;nomique, la prot&eacute;omique et la biologie des syst&egrave;mes, combin&eacute;s &agrave; une explosion de la litt&eacute;rature scientifique disponible, et &agrave; une quantit&eacute; croissante de donn&eacute;es posent toutefois un probl&egrave;me majeur: l&rsquo;extraction d&rsquo;informations utiles &agrave; partir de ces donn&eacute;es (Larra&ntilde;aga et al., 2006). Cette situation est reconnue comme un environnement &laquo;Big Data&raquo; n&eacute;cessitant de nouvelles approches pour l'analyse, l'interpr&eacute;tation et l'utilisation de ces donn&eacute;es. Aujourd&rsquo;hui, c&rsquo;est l&rsquo;un des principaux d&eacute;fis de la bio-informatique, qui n&eacute;cessite le d&eacute;veloppement d&rsquo;outils et de m&eacute;thodes capables de transformer toutes ces donn&eacute;es en connaissances biologiques. L&rsquo;intelligence artificielle (IA) peut dans ce cadre acc&eacute;l&eacute;rer le traitement et l&rsquo;analyse de ces donn&eacute;es provenant de sources h&eacute;t&eacute;rog&egrave;nes. On parle ici possiblement d&rsquo;int&eacute;gration de donn&eacute;es multi-omics, de mesures biologiques, ou encore de r&eacute;sultats de tests sp&eacute;cifiques afin d&rsquo;&eacute;tablir des mod&egrave;les fonctionnels. Quelques exemples des applications bio-informatiques avanc&eacute;es support&eacute;es par l'intelligence artificielle incluent la modélisation et prédiction de syst&egrave;mes biologiques complexes, la d&eacute;couverte et la conception de m&eacute;dicaments et l'optimisation des diagnostiques m&eacute;dicaux (Jiang et al., 2017).</p>
          <p><strong>&nbsp;</strong></p>
          <p>L'intelligence artificielle (IA) est apparue comme un domaine dans les ann&eacute;es 1950, dans l&rsquo;'id&eacute;e que les processus du raisonnement humain peuvent &ecirc;tre d&eacute;crits, et simul&eacute;s par des machines. Elle utilise des m&eacute;thodes probabilistiques et statistique pour effectuer des op&eacute;rations telles que le raisonnement, l'extraction de connaissances, la planification, l'apprentissage et la prise de d&eacute;cision. Le d&eacute;veloppement des algorithmes tel que le deep learning &agrave; permis de d&eacute;passer l&rsquo;homme dans certaines disciplines que l&rsquo;on pensait impossibles pour la machine, notamment le jeu d&rsquo;&eacute;checs en 1997 avec DeepBlue (Campbell, Hoane, &amp; Hsu, 2002) ou encore le jeu de Go (Silver et al., 2016). Aujourd&rsquo;hui, ces algorithmes sont aussi appliqu&eacute;s &agrave; un large &eacute;ventail de domaines. Ces applications comprennent les logiciels de synth&egrave;se vocale, la vision par ordinateur et la reconnaissance faciale, les jeux, les applications militaires et spatiales, les applications financi&egrave;res et autres. Il est clair que l&rsquo;application des techniques d&rsquo;intelligence artificielle en bio-informatique tel que le machine Learning et le deep learning suscite un int&eacute;r&ecirc;t croissant. Afin de citer les grands domaines de l&rsquo;IA en termes de types d&rsquo;activit&eacute;, il est possible de mentionner la reconnaissance et l&rsquo;interpr&eacute;tation de donn&eacute;es qui peuvent &ecirc;tre de nature tr&egrave;s vari&eacute;es et n&eacute;cessiter des traitements tr&egrave;s diff&eacute;rents) , l&rsquo;aide &agrave; la d&eacute;cision dans le cas de diagnostique, et le traitement de la langue naturelle pour extraire l&rsquo;information scientifique des revues (Larra&ntilde;aga et al., 2006).</p>
          <p>&nbsp;</p>
          <p>Nous allons ici d&eacute;crire et discuter des exemples d&rsquo;applications g&eacute;n&eacute;rales de l&rsquo;IA en bio-informatique en utilisant les exemples des probl&eacute;matiques dans les domaines de sant&eacute;, agriculture et environnement et en discuter l&rsquo;importance d&rsquo;un point de vue soci&eacute;tal et &eacute;conomique. De plus nous verrons un cas pratique d&rsquo;application d&rsquo;une technique d&rsquo;apprentissage machine afin d&rsquo;&eacute;tablir un mod&egrave;le de pr&eacute;diction d&rsquo;une cellule b&eacute;nigne ou canc&eacute;reuse.</p>

        </div>
        </div>
      </div>
    </div>
  </section>

  <section id="Application" class="bg-light">
    <div class="container">
      <div class="row">
        <div class="col-lg-8 mx-auto">
          <h2>Applications</h2>
          <p class="lead">
<div align="justify">
            <p><strong>Secteur de Sant&eacute;</strong></p>
            <p>Les erreurs de diagnostic constituent une probl&eacute;matique pour la qualit&eacute; et la s&eacute;curit&eacute; des soins de sant&eacute;. Il est estim&eacute; que le taux d'erreurs de diagnostic est de 5% aux &Eacute;tats-Unis, ce qui veut dire 12 millions d'adultes chaque ann&eacute;e. Environ la moiti&eacute; de ces erreurs pourraient &ecirc;tre potentiellement n&eacute;fastes. L&rsquo;AI a &eacute;t&eacute; utilis&eacute;e pour am&eacute;liorer la qualit&eacute; des diagnostics m&eacute;dicaux, en particulier en radiologie, en raison du volume important de donn&eacute;es d'imageries m&eacute;dicales (Singh, Meyer, &amp; Thomas, 2014).</p>
            <p>Th&eacute;oriquement, l'application de l'IA peut &ecirc;tre &eacute;tendue &agrave; presque tous les aspects des soins de sant&eacute;. Les progr&egrave;s technologiques ont permis de construire des &eacute;quipements m&eacute;dicaux modernes en int&eacute;grant la technologie d'intelligence artificielle, ce qui a aid&eacute; dans la d&eacute;cision clinique. Il a &eacute;t&eacute; d&eacute;montr&eacute; que l&rsquo;IA &eacute;tait un soutien pr&eacute;cieux pour les professionnels de la sant&eacute; en clinique. Par exemple; L'apprentissage automatique a permis de pr&eacute;dire des diagnostics selon les caract&eacute;ristiques cliniques du patient. De plus; il est maintenant possible d&rsquo;analyser les donn&eacute;es comportementales sur les r&eacute;seaux sociaux pour pr&eacute;dire les risques de sant&eacute; des patients(Guo &amp; Li, 2018). Dans les innovations r&eacute;centes pour palier &agrave; ce sujet on note les projets tel que IBM watson, Deepmind health, ou encore Google Brain (Lu, Li, Chen, Kim, &amp; Serikawa, 2018).</p>
            <p>&nbsp;</p>
            <p>Une partie des applications r&eacute;centes en sciences m&eacute;dicales ont port&eacute; sur l'analyse de l'expression g&eacute;nique. Ceci implique g&eacute;n&eacute;ralement l&rsquo;accumulation des donn&eacute;es d'expression de g&egrave;nes pour des cellules affect&eacute;es par diff&eacute;rentes maladies telles que le cancer, l'art&eacute;rioscl&eacute;rose, ou encore le diabète et la comparaison des mesures avec les niveaux d'expression normaux. L'identification de g&egrave;nes qui sont exprim&eacute;s diff&eacute;remment dans les cellules touch&eacute;es donne une explication des causes des maladies, met en avant des cibles potentielles de m&eacute;dicaments et permet de r&eacute;aliser des tests pr&eacute;ventifs pour d&eacute;tecter ou pr&eacute;dire la toxicit&eacute; des m&eacute;dicaments &agrave; l&rsquo;essai (Murray-Rust, 1994). Il est aussi possible de s&rsquo;orienter vers le domaine du &laquo;&nbsp;drug design&nbsp;&raquo; qui permet de pr&eacute;dire les r&eacute;actions mol&eacute;culaires et de mieux concevoir les m&eacute;dicaments (Chen, Engkvist, Wang, Olivecrona, &amp; Blaschke, 2018)</p>
            <p>De plus, les progr&egrave;s de la bio-informatique, combin&eacute;s &agrave; la g&eacute;nomique, devraient r&eacute;volutionner l&rsquo;avenir des soins de sant&eacute; personnalis&eacute;s. Par exemple, Il serait possible de commencer avec un g&eacute;notypage postnatal pour &eacute;valuer la susceptibilit&eacute; ou l'immunit&eacute; d&rsquo;un nouveau-n&eacute; face &agrave; certaines maladies sp&eacute;cifiques. Gr&acirc;ce &agrave; ces informations, une combinaison unique de vaccins pourrait &ecirc;tre prescrite, ce qui minimiserait les co&ucirc;ts de soins de sant&eacute; li&eacute;s aux traitements inutiles et anticiperait l&rsquo;attaque de maladies plus tard dans la vie. Des d&eacute;pistages r&eacute;guliers tout au long de la vie pourraient donner des indications sur l&rsquo;apport nutritionnel et la d&eacute;tection pr&eacute;coce de toute maladie (Sander, 2000). Les traitements m&eacute;dicaux pourraient &ecirc;tre adapt&eacute;s sp&eacute;cifiquement au patient et &agrave; la maladie, offrant ainsi le traitement le plus efficace avec des effets secondaires minimes (Ohlstein, Jr., &amp; Elliott, 2000).</p>
<p>&nbsp;</p>
            <figure class="text-center">
              <img src=".images/fig11.jpg" class="figure-img img-fluid rounded" >

              <figcaption class="figure-caption">
                Figure 1. Les algorithmes d'apprentissage automatique utilisés dans la littérature médicale. Les données sont générées en recherchant des algorithmes d'apprentissage automatique dans PubMed dans le secteur de la santé.</figcaption>
            </figure>


<p>&nbsp;</p>
<p>&nbsp;</p>

            <p><strong>Secteur de l&rsquo;agronomie</strong></p>

            <p>L'agronomie joue un r&ocirc;le crucial dans l'&eacute;conomie mondiale. Toutefois la pression sur le syst&egrave;me agricole va augmenter avec l'expansion continue de la population humaine. L&rsquo;agriculture de &laquo;&nbsp;pr&eacute;cision&nbsp;&raquo; est d&eacute;sormais apparue comme un nouveau domaine scientifique qui utilise des dimensions importantes de donn&eacute;es. Il est important de trouver des approches pour stimuler la productivit&eacute; agricole tout en minimisant son impact environnemental. Les donn&eacute;es g&eacute;n&eacute;r&eacute;es dans les industries agronomiques modernes sont fournies par une vari&eacute;t&eacute; de capteurs diff&eacute;rents qui permettent une meilleure compr&eacute;hension de l&rsquo;environnement du produit fourni (composition du sol, conditions m&eacute;t&eacute;orologiques, m&eacute;tag&eacute;nomique des sols, g&eacute;nome du b&eacute;tail) en plus des donn&eacute;es capt&eacute;es par les machines utilis&eacute;es. (Finch, Samuel, &amp; Lane, 2014). De plus, l'agriculture de pr&eacute;cision permet &agrave; l'agriculteur de toucher des b&eacute;n&eacute;fices gr&acirc;ce &agrave; une meilleure gestion, une r&eacute;duction des co&ucirc;ts de production et tend vers des traitements chimiques plus appropri&eacute;s afin de minimiser l&rsquo;impact environnemental. Par exemple, selon le type de culture, il est possible d&rsquo;ajuster le niveau de fertiliser afin d&rsquo;en &eacute;viter le gaspillage, augmenter le rendement des cultures en analysant les niveaux d&rsquo;expression g&eacute;niques optimaux, et optimiser les fr&eacute;quences de s&egrave;mes via des algorithmes de machine learning permettant d&rsquo;analyser les donn&eacute;es recueillies dans le pass&eacute; et d&rsquo;en tirer des conclusions &eacute;clair&eacute;es pour le futur.</p>

            <p>La plupart des travaux actuels reposent sur la mod&eacute;lisation ou la simulation pour tenter de pr&eacute;dire quelle sera la r&eacute;action de la culture &agrave; plusieurs facteurs tels que les populations de mauvaises herbes, la pression des maladies, les facteurs m&eacute;t&eacute;orologiques, les conditions du sol, afin de fournir aux agriculteurs un syst&egrave;me de d&eacute;cision le plus pr&eacute;cis possible (Blackmore, 1994).</p>
            <p>Avec une population qui devrait atteindre plus de 10 milliards d&rsquo;ici 2075 sur les 7 milliards d&rsquo;aujourd&rsquo;hui, avec la perte des terres cultivables et du climat changeant, r&eacute;duisant les capacit&eacute;s de production de nombreux pays tr&egrave;s peupl&eacute;s, avec la diminution des r&eacute;serves d&rsquo;&eacute;nergie fossile et la volont&eacute; de r&eacute;duire l&rsquo;impact environnemental, une forte pression est exerc&eacute;e pour faire un meilleur usage de la capacit&eacute; agricole. L&rsquo;agriculture de pr&eacute;cision jouera un r&ocirc;le important &agrave; ce moment.</p>
          </div>
      </div>
    </div>
  </section>

  <section id="Demonstration">
    <div class="container">
      <div class="row">
        <div class="col-lg-8 mx-auto">
          <h2>Demonstration</h2>
          <p class="lead">
            <div align="justify">

              <p>Pour cette partie, il est question d&rsquo;&eacute;tablir un mod&egrave;le de pr&eacute;diction avec un arbre de d&eacute;cision sur des donn&eacute;es de cellules canc&eacute;reuses provenant du Package R&nbsp; &laquo;&nbsp;mlbench&nbsp;&raquo;.</p>

              <p><strong>Data sets&nbsp;:</strong>
              <a href="https://www.rdocumentation.org/packages/mlbench/versions/2.1-1/topics/BreastCancer">Donn&eacute;s de cellules de sein cancéreuse et saine parvenu du Dr. WIlliam H. Wolberg (physician); University of Wisconsin Hospital ;Madison; Wisconsin; USA.</a></p>


              <figure class="text-center">
                <img src=".images/fig1.png" class="figure-img img-fluid rounded" >

                <figcaption class="figure-caption">
                  Figure 2. Matrice de données du dataset Breastcancer fourni par l'hôpital universitaire du Wisconsin.</figcaption>
              </figure>
                <p>&nbsp;</p>
                Chaque variable, à l'exception de la première, a été convertie en 11 attributs numériques primitifs dont les valeurs vont de 0 à 10.
                <p>&nbsp;</p>
              <figure class="text-center">
                <img src=".images/fig2.png" class="figure-img img-fluid rounded" >

                <figcaption class="figure-caption">
                  Figure 3. Code R pour aboutir à l'arbre de décision</figcaption>
              </figure>
              <p>&nbsp;</p>
              <figure class="text-center">
                <img src=".images/fig3.png" class="figure-img img-fluid rounded" >

                <figcaption class="figure-caption">
                  Figure 4. Arbre de décision obtenus</figcaption>
              </figure>
              <p>&nbsp;</p>
              <figure class="text-center">
                <img src=".images/fig4.png" class="figure-img img-fluid rounded" >

                <figcaption class="figure-caption">
                    Figure 5. Matrice de confusion de l'arbre de décision</figcaption>
              </figure>
On remarque ici la précision allant à 0.93 ce qui atteste d’un bon modèle de prédiction.

    </div>
        </div>
    </div>
  </section>
  <section id="Conclusion">
    <div class="container">
      <div class="row">
        <div class="col-lg-8 mx-auto">
          <h2>Conclusion</h2>
          <p class="lead">
            <div align="justify">

            <p>Avec le d&eacute;luge actuel de donn&eacute;es, les m&eacute;thodes de calcul sont devenues indispensables pour r&eacute;pondre aux probl&eacute;matiques biologiques. D&eacute;velopp&eacute;e &agrave; l'origine pour l'analyse de s&eacute;quences biologiques, la bio-informatique englobe d&eacute;sormais un large &eacute;ventail de domaines, notamment la biologie structurale, la g&eacute;nomique et les &eacute;tudes d'expression g&eacute;nique. L'apprentissage automatique est une branche de l'intelligence artificielle qui utilise diverses techniques statistiques, probabilistes et d'optimisation permettant aux ordinateurs de &laquo;tirer des enseignements&raquo; des exemples pass&eacute;s et de d&eacute;tecter les tendances difficiles &agrave; discerner dans des ensembles de donn&eacute;es volumineux, bruyants ou complexes. Cette capacit&eacute; est particuli&egrave;rement bien adapt&eacute;e aux applications m&eacute;dicales, en particulier celles qui d&eacute;pendent de mesures prot&eacute;iques et g&eacute;nomiques complexes. En cons&eacute;quence, l'apprentissage automatique est fr&eacute;quemment utilis&eacute; dans le diagnostic et la d&eacute;tection du cancer. Plus r&eacute;cemment, l'apprentissage automatique a &eacute;t&eacute; appliqu&eacute; au domaine de l&rsquo;agriculture de pr&eacute;cision afin de r&eacute;pondre &agrave; une responsabilit&eacute; environnementale en plus de fournir une augmentation de rendement assez cons&eacute;quente. De cette mani&egrave;re, nous sommes en mesure d&rsquo;examiner en d&eacute;tails les syst&egrave;mes individuels et de les comparer de mani&egrave;re fonctionnelle en prenant en compte le plus de facteurs externe important pouvant les affecter. Le b&ucirc;t &eacute;tant de d&eacute;couvrir des mod&egrave;les s&rsquo;appliquant &agrave; de nombreux syst&egrave;mes et de mettre en &eacute;vidence des caract&eacute;ristiques particuli&egrave;re &agrave; certains syst&egrave;mes. Pour finir, la bio-informatique a non seulement approfondi les investigations biologiques, mais &eacute;galement ajout&eacute;es des dimensions aux analyses.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p><strong>Bibliographie</strong></p>
<p><strong>&nbsp;</strong></p>
<p>Blackmore, S. (1994). Precision Farming: An Introduction. <em>Outlook on Agriculture, 23</em>(4), 275-280. doi:10.1177/003072709402300407</p>
<p>Campbell, M., Hoane, A. J., &amp; Hsu, F.-h. (2002). Deep Blue. <em>Artificial Intelligence, 134</em>(1), 57-83. doi:<a href="https://doi.org/10.1016/S0004-3702(01)00129-1">https://doi.org/10.1016/S0004-3702(01)00129-1</a></p>
<p>Chen, H., Engkvist, O., Wang, Y., Olivecrona, M., &amp; Blaschke, T. (2018). The rise of deep learning in drug discovery. <em>Drug Discovery Today, 23</em>(6), 1241-1250. doi:<a href="https://doi.org/10.1016/j.drudis.2018.01.039">https://doi.org/10.1016/j.drudis.2018.01.039</a></p>
<p>Finch, H. J. S., Samuel, A. M., &amp; Lane, G. P. F. (2014). 10 - Precision farming. In H. J. S. Finch, A. M. Samuel, &amp; G. P. F. Lane (Eds.), <em>Lockhart &amp; Wiseman&rsquo;s Crop Husbandry Including Grassland (Ninth Edition)</em> (pp. 235-244): Woodhead Publishing.</p>
<p>Guo, J., &amp; Li, B. (2018). <em>The Application of Medical Artificial Intelligence Technology in Rural Areas of Developing Countries</em> (Vol. 2).</p>
<p>Jiang, F., Jiang, Y., Zhi, H., Dong, Y., Li, H., Ma, S., . . . Wang, Y. (2017). Artificial intelligence in healthcare: past, present and future. <em>Stroke and vascular neurology, 2</em>(4), 230-243. doi:10.1136/svn-2017-000101</p>
<p>Larra&ntilde;aga, P., Calvo, B., Santana, R., Bielza, C., Galdiano, J., Inza, I., . . . Robles, V. (2006). Machine learning in bioinformatics. <em>Briefings in Bioinformatics, 7</em>(1), 86-112. doi:10.1093/bib/bbk007</p>
<p>Lu, H., Li, Y., Chen, M., Kim, H., &amp; Serikawa, S. (2018). Brain Intelligence: Go beyond Artificial Intelligence. <em>Mobile Networks and Applications, 23</em>(2), 368-375. doi:10.1007/s11036-017-0932-8</p>
<p>Murray-Rust, P. (1994). Bioinformatics and drug discovery. <em>Current Opinion in Biotechnology, 5</em>(6), 648-653. doi:<a href="https://doi.org/10.1016/0958-1669(94)90089-2">https://doi.org/10.1016/0958-1669(94)90089-2</a></p>
<p>Ohlstein, E. H., Jr., R. R. R., &amp; Elliott, J. D. (2000). Drug Discovery in the Next Millennium. <em>Annual Review of Pharmacology and Toxicology, 40</em>(1), 177-191. doi:10.1146/annurev.pharmtox.40.1.177</p>
<p>Sander, C. (2000). Genomic Medicine and the Future of Health Care. <em>Science, 287</em>(5460), 1977-1978. doi:10.1126/science.287.5460.1977</p>
<p>Silver, D., Huang, A., Maddison, C. J., Guez, A., Sifre, L., van den Driessche, G., . . . Hassabis, D. (2016). Mastering the game of Go with deep neural networks and tree search. <em>Nature, 529</em>, 484. doi:10.1038/nature16961</p>
<p><a href="https://www.nature.com/articles/nature16961#supplementary-information">https://www.nature.com/articles/nature16961#supplementary-information</a></p>
<p>Singh, H., Meyer, A. N. D., &amp; Thomas, E. J. (2014). The frequency of diagnostic errors in outpatient care: estimations from three large observational studies involving US adult populations. <em>BMJ quality &amp; safety, 23</em>(9), 727-731. doi:10.1136/bmjqs-2013-002627</p>
          </div>
        </div>
      </div>
    </div>
  </section>

  <!-- Footer -->
  <footer class="py-5 bg-dark">
    <div class="container">
      <p class="m-0 text-center text-white">Copyright &copy; Rafik M. Chemli 2019</p>
    </div>
    <!-- /.container -->
  </footer>

  <!-- Bootstrap core JavaScript -->
  <script src="vendor/jquery/jquery.min.js"></script>
  <script src="vendor/bootstrap/js/bootstrap.bundle.min.js"></script>

  <!-- Plugin JavaScript -->
  <script src="vendor/jquery-easing/jquery.easing.min.js"></script>

  <!-- Custom JavaScript for this theme -->
  <script src="js/scrolling-nav.js"></script>

</body>

</html>
